v2206/multiphase_solverComparisons/interCondensateEvaporateFoam/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases              (fluid air);

sigma
{
    type            constant;
    sigma           0.07;
}

Prt                 0.7;

fluid
{
    transportModel  Newtonian;
    nu              1e-6;
    rho             1000;

    Cp              4.186e3;
    Cv              4.186e3;   // assume Cp for fluid
    kappa           0.6;
    hf              -2.4e6;
}

air
{
    transportModel  Newtonian;
    nu              1.8e-08;
    rho             1.3;

    Cp              1.87e3;     // water air
    Cv              1.41e3;     // Cv = Cp - R/w
    kappa           0.026;      // water air
    hf              0;
}



// ************************************************************************* //
